define.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Org mode LaTeX macros (for both HTML and LaTeX export)</title>
<!-- 2016-08-21 Sun 20:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Brian C. Wells" />
</head>
<body>
<div id="content">
<h1 class="title">Org mode LaTeX macros (for both HTML and LaTeX export)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Define the Org mode macros</a>
<ul>
<li><a href="#sec-1-1">when-fmt macro</a></li>
<li><a href="#sec-1-2">preamble macro</a></li>
<li><a href="#sec-1-3">define macro</a></li>
</ul>
</li>
<li><a href="#sec-2">Usage Example</a></li>
</ul>
</div>
</div>
<p>
\(\newcommand{\mat}[1]{\mathbf{#1}}\)
</p>

<p>
This document should be exported to <a href="define.html">HTML</a> and <a href="define.tex">LaTeX</a> to check that the
proper code is generated.  <a href="define.pdf">A PDF file</a> should also be available, but
looks a bit bad because Org mode macros <i>must</i> be written on a single
line, and some of these macros overfill the line (even in a fairly
small font).
</p>

<p>
This Literate Program is an Org mode setup file that makes it easy to
define LaTeX macros that work in <i>both</i> LaTeX and HTML export.  To
"tangle" the source code (<code>define.org</code>) for this document to generate
the <code>define.setup</code> file, type the key sequence <code>C-c C-v t</code> in Emacs
(with the default keymap).  The first line makes sure that the file
can be edited in org-mode despite the file being named with an
extension of <code>.setup</code>.
</p>

<div class="org-src-container">

<pre class="src src-org"># -*- mode: org -*-
#+MACRO: when-fmt (eval (when (org-export-derived-backend-p org-export-current-backend '$1) "$2"))
#+MACRO: preamble {{{when-fmt(html,\\($1\\))}}}{{{when-fmt(latex,#+LATEX_HEADER: $1)}}}
#+MACRO: define   {{{preamble(\\newcommand{$1}$2)}}}
</pre>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Define the Org mode macros</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">when-fmt macro</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This is inspired by the <code>if-latex-else</code> macro under the `Advanced'
heading here: <a href="https://github.com/fniessen/org-macros">https://github.com/fniessen/org-macros</a>. Apparently,
Org mode will evalute Emacs Lisp code in macros, although I have not
yet found any documentation that explains <i>why</i> this works.
</p>

<p>
The <code>when</code> form is like <code>if</code>, except it only returns a string when the
condition is true, returning <code>nil</code> instead when it is false.  We use
<code>when</code> because we want to perform an action for LaTeX and HTML
formats, and we do not want to assume that the user wants the same
behavior for all non-LaTeX or non-HTML formats.
</p>

<div class="org-src-container">

<pre class="src src-org">#+MACRO: when-fmt (eval (when (org-export-derived-backend-p org-export-current-backend '$1) "$2"))
</pre>
</div>

<p>
Since the second parameter <code>$2</code> is used inside quotes, it will be
necessary to double any backslashes, despite the fact that Org mode
macros do not normally require this (except between parameters).
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">preamble macro</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Using the <a href="#sec-1-1">when-fmt macro</a>, we wrap HTML output in <code>\(...\)</code> so that <a href="http://docs.mathjax.org/en/latest/tex.html#defining-tex-macros">the
MathJax library will recognize that it should process them</a>.  So long
as we only use this to define LaTeX macros, MathJax will not generate
any spurious output.  In LaTeX output, we use the <code>#+LATEX_HEADER:</code>
Org mode syntax to ensure that it is put in the proper LaTeX preamble.
</p>

<div class="org-src-container">

<pre class="src src-org">#+MACRO: preamble {{{when-fmt(html,\\($1\\))}}}{{{when-fmt(latex,#+LATEX_HEADER: $1)}}}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">define macro</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Using the <a href="#sec-1-2">preamble macro</a>, we specify a macro that uses the LaTeX
<code>\newcommand</code> macro to define macros.  The first argument is the macro
command sequence, and the second argument is whatever LaTeX code is
needed for the definition.  Note that we wrap the command sequence in
<code>{...}</code> automatically, since this is always done.  The second
parameter is not, however, because it is sometimes necessary to write
a number in square brackets <code>[...]</code> when the macro takes parameters.
</p>

<div class="org-src-container">

<pre class="src src-org">#+MACRO: define   {{{preamble(\\newcommand{$1}$2)}}}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Usage Example</h2>
<div class="outline-text-2" id="text-2">
<p>
Say you want to define a <code>\mat</code> command to write the names of
matrices, as in <code>\mat{A}</code> for \(\mat{A}\).
</p>

<p>
At the beginning of the file, you should add
</p>
<pre class="example">
#+SETUPFILE: define.setup
</pre>
<p>
and then you can write
</p>
<pre class="example">
{{{define(\\mat,[1]{\\mathbf{#1}})}}}
</pre>
<p>
and use it as follows:
</p>
<pre class="example">
$\mat{A}$
</pre>

<p>
Again, remember: it is necessary to double the backslashes.  And the
result looks like this: \(\mat{A}\).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brian C. Wells</p>
<p class="date">Created: 2016-08-21 Sun 20:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
